Revit 2024 API
FabricationAncillaryUsageType Enumeration
 An enumerated type describing where an ancillary is used on a fabrication part.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public enum FabricationAncillaryUsageType
Visual Basic
Public Enumeration FabricationAncillaryUsageType
Visual C++
public enum class FabricationAncillaryUsageType
Members
Member name | Description
Undefined |  Undefined usage.
Loose |  Miscellaneous loose ancillary defined on the part.
Connector |  Ancillary makes up a fabrication part connector.
Seam |  Ancillary is associated with a seam on development(s).
Splitter |  Ancillary makes up a fabrication part splitter.
Airturn |  Ancillary makes up a fabrication part airturn or vane.
Hanger |  Ancillary makes up a fabrication part hanger.
Stiffener |  Ancillary makes up a fabrication part internal or external stiffener.
See Also
Autodesk.Revit.DB.Fabrication Namespace